<div id="ajaxLinkWindow" class="ajaxLinkWindow">
		<div class="windowTop">
			<div class="windowTitle">珠海农商银行服务条款</div>
			<a class="windowClose ajaxLinkWindowClose" href="javascript:void(0)" hidefocus="true"></a>
		</div>
		<div class="windowMiddle">
			<table>
				
				<tr>
					<td>
						<textarea readonly="readonly" name="mytext" rows="20" cols="80" class="jqtransformdone">		珠海农商银行·生活平台网站用户注册协议
	本协议由您与上海方付通商务服务有限公司共同缔结，请您仔细阅读本注册协议，您点击“同意以下协议并注册”按钮后，本协议即构成双方有约束力的法律文件。

本站服务条款的确认和接纳
1、本站的各项电子服务的所有权和运作权归方付通公司所有。用户同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。
2、用户点击同意本协议的，即视为用户确认自己具有享受本站服务、下单购物等相应的权利能力和行为能力，能够独立承担法律责任。如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用本站。
3、您应当在使用方付通PC商城服务之前认真阅读全部协议内容，对于协议中以加粗字体显示的内容，您应重点阅读。如您对协议有任何疑问的，应向方付通咨询。但无论您事实上是否在使用方付通PC商城服务之前认真阅读了本协议内容，只要您使用方付通PC商城服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得方付通对您问询的解答等理由，主张本协议无效，或要求撤销本协议。
4、您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序并停止使用方付通PC商城服务。
5、方付通有权根据需要不时地制订、修改本协议及（或）各类规则，并以网站公示的方式进行公告，不再单独通知您。变更后的协议和规则一经在网站公布后，立即自动生效。如您不同意相关变更，应当立即停止使用方付通PC商城服务。您继续使用方付通PC商城服务的，即表示您接受经修订的协议和规则。

第二条  本站服务
1、方付通PC商城通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务。
2、用户必须自行准备如下设备和承担如下开支：（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。

第三条  用户信息
1、用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且方付通公司保留终止用户使用方付通PC商城各项服务的权利。
2、用户在本站进行浏览、下单购物等活动时，涉及用户真实姓名或名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。
3、用户注册成功后，将产生用户名和密码等账户信息，您可以根据本站规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。
4、用户同意，方付通PC商城拥有通过邮件、短信电话等形式，向在本站注册、购物用户、收货人发送订单信息、促销活动等告知信息的权利。
5、用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。
6、用户同意，方付通PC商城有权使用用户的注册信息、用户名、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。

第四条  使用规范
1、本协议依据国家相关法律法规规章制定，用户同意严格遵守：在使用方付通PC商城服务过程中，实施的所有行为均遵守国家法律、法规等规范性文件及方付通PC商城各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保方付通免于因此产生的任何损失。
2、方付通有权对您是否违反上款承诺做出单方认定，并根据单方认定结果适用规则予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。
3、经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者方付通根据自身的判断，认为您的行为涉嫌违反本协议和（或）规则的条款或涉嫌违反法律法规的规定的，则方付通有权在方付通PC商城上公示您的该等涉嫌违法或违约行为及方付通已对您采取的措施。
4、对于您在方付通PC商城上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议和（或）规则的信息，方付通有权不经通知您即予以删除，且按照规则的规定进行处罚。
5、对于您在方付通PC商城上实施的行为，包括您未在方付通PC商城上实施但已经对方付通PC商城及其用户产生影响的行为，方付通有权单方认定您行为的性质及是否构成对本协议和（或）规则的违反，并据此作出相应处罚。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。
6、如您涉嫌违反有关法律或者本协议之规定，使方付通遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿方付通因此造成的损失及（或）发生的费用，包括合理的律师费用，并承担相应法律责任。
7、用户应不时关注并遵守本站不时公布或修改的各类合法规则规定。

第五条  商品信息
1、本站上的商品价格、数量、是否有货等商品信息随时都有可能发生变动，本站不作特别通知。由于网站上商品信息的数量极其庞大，虽然本站会尽最大努力保证您所浏览商品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本站网页显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解。
2、为表述便利，商品和服务简称为“商品”或“货物”。

第六条  订单
1、在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与用户本人不一致的，收货人的行为和意思表示视为用户的行为和意思表示，用户应对收货人的行为及意思表示的法律后果承担连带责任。
2、您可以随时登陆您在本站注册的账户，查询您的订单状态。

第七条  责任范围和责任限制
1、除非另有明确的书面说明，本站及其所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。但方付通对方付通PC商城服务不作任何明示或暗示的保证，包括但不限于方付通PC商城服务的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。同时，方付通也不对方付通PC商城服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性作出任何承诺和保证。
2、除非另有明确的书面说明，方付通PC商城不对本站的运营及其包含在本网站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。
3、方付通PC商城不担保本站所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从本站发出的电子信件、信息没有病毒或其他有害成分。
4、方付通PC商城仅作为交易地点。方付通PC商城仅作为您获取物品或服务信息、物色交易对象、就物品和（或）服务的交易进行协商及开展交易的场所，但方付通无法控制交易所涉及的物品的质量、安全或合法性，商贸信息的真实性或准确性，以及交易各方履行其在贸易协议中各项义务的能力。您应自行谨慎判断确定相关物品及(或)信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。
5、您了解并同意，方付通不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿 (无论方付通是否已被告知该等损害赔偿的可能性) ：
（1）使用或未能使用方付通PC商城服务；
（2）第三方未经批准的使用您的账户或更改您的数据；
（3）通过方付通PC商城服务购买或获取任何商品、样品、数据、信息或进行交易等行为或替代行为产生的费用及损失；
（4）您对方付通PC商城服务的误解；
（5）任何非因方付通的原因而引起的与方付通PC商城服务有关的其它损失。
6、如用户指定的商品缺货、价格变动、发货不及时以及货物异常或者其它不可抗原因,造成方付通无法代购的，方付通会与用户沟通协商处理，除向用户返还其已支付的款项外，方付通不向用户承担任何违约责任。
7、不论在何种情况下，方付通均不对由于信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。

第八条  协议终止
1、您同意，方付通有权自行全权决定以任何理由不经事先通知的中止、终止向您提供部分或全部方付通PC商城服务，且无须为此向您或任何第三方承担任何责任。
2、出现以下情况时，方付通有权直接以注销账户的方式终止本协议:
（1）方付通终止向您提供服务后，您涉嫌再一次直接或间接或以他人名义注册为方付通PC商城用户的；
（2）您提供的电子邮箱不存在或无法接收电子邮件，且没有其他方式可以与您进行联系，或方付通以其它联系方式通知您更改电子邮件信息，而您在方付通通知后三个工作日内仍未更改为有效的电子邮箱的；
（3）您注册信息中的主要内容不真实或不准确或不及时或不完整；
（4）本协议（含规则）变更时，您明示并通知方付通不愿接受新的服务协议的；
（5）其它方付通认为应当终止服务的情况。
3、您有权向方付通要求注销您的账户，经方付通审核同意的，方付通注销您的账户，届时，您与方付通基于本协议的合同关系即终止。您的账户被注销后，方付通没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。
4、您同意，您与方付通的合同关系终止后，方付通仍享有下列权利：
（1）继续保存您的注册信息及您使用方付通PC商城服务期间的所有交易信息；
（2）您在使用方付通PC商城服务期间存在违法行为或违反本协议和（或）规则的行为的，方付通仍可依据本协议向您主张权利；

第九条  所有权及知识产权
1、用户一旦接受本协议，即表明该用户主动将其在任何时间段在本站发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给方付通PC商城所有，用户同意方付通PC商城有权就任何主体侵权而单独提起诉讼。
2、本协议已经构成《中华人民共和国著作权法》及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在方付通PC商城网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。
3、用户同意并已充分了解本协议的条款，承诺不将已发表于本站的信息，以任何形式发布或授权其它主体以任何方式使用（包括但限于在各类网站、媒体上使用）。
4、方付通公司是本站的制作者,拥有此网站内容及资源的著作权等合法权利，受国家法律保护，有权不时地对本协议及本站的内容进行修改，并在本站张贴，无须另行通知用户。在法律允许的最大限度范围内，方付通公司对本协议及本站内容拥有解释权。
5、除法律另有强制性规定外，未经方付通公司明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本站的信息内容，否则，方付通PC商城有权追究其法律责任。
6、本站所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据 编辑和软件），均是方付通PC商城或其内容提供者的财产，受中国和国际版权法的保护。本站上所有内容的汇编是方付通PC商城的排他财产，受中国和国际版权法的保护。本站上所有软件都是方付通公司或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。

第十条  法律管辖及适用
1、本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定的，则应参照通用国际商业惯例和（或）行业惯例。
2、如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。
3、如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向有管辖权的中华人民共和国大陆地区法院提起诉讼。

第十一条  其他
1、方付通PC商城网站所有者是指在政府部门依法许可或备案的方付通PC商城网站经营主体。
2、您点击本协议的“同意以下协议并注册”按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。
		</textarea>
					</td>
				</tr>
			</table>
		</div>
		<div class="windowBottom"></div>
</div>