package com.froad.CB.dao.user;

import com.pay.user.dto.UserResult;
import com.pay.user.dto.UserSpecDto;
import com.pay.user.helper.CreateChannel;

/**
 * *******************************************************
 *<p> 工程: communityBusiness </p>
 *<p> 类名: UserSpecFunc.java </p>
 *<p> 描述: *-- <b>连接账户账务user公共方法</b> --* </p>
 *<p> 作者: 赵肖瑶 </p>
 *<p> 时间: 2013-9-24 上午11:46:29 </p>
 ********************************************************
 */
public interface UserSpecFunc {

	/**
	 * *******************************************************
	 *<p> 描述: *-- <b>注册用户</b> --* </p>
	 *<p> 作者: 赵肖瑶 </p>
	 *<p> 时间: 2013-9-24 上午11:59:34 </p>
	 *<p> 版本: 1.0.1 </p>
	 *********************************************************
	 */
	public UserResult registerMember(UserSpecDto usd);


	/**
	 * *******************************************************
	 *<p> 描述: *-- <b>通过MemberCode更新User</b> --* </p>
	 *<p> 作者: 赵肖瑶 </p>
	 *<p> 时间: 2013-9-24 下午01:42:36 </p>
	 *<p> 版本: 1.0.1 </p>
	 *********************************************************
	 */
	public UserResult updateMemberInfoByMemberCode(UserSpecDto usd);
	
	
	/**
	 *********************************************************
	 *<p> 描述: *-- <b>查询用户通过userID</b> --* </p>
	 *<p> 作者: 赵肖瑶 </p>
	 *<p> 时间: 2013-9-24 下午03:25:50 </p>
	 *<p> 版本: 1.0.1 </p>
	 *********************************************************
	 */
	public UserResult queryByUserID(String userID);
	
	/**
	 * *******************************************************
	 *<p> 描述: *-- <b>通过MemberCode查询用户信息</b> --* </p>
	 *<p> 作者: 赵肖瑶 </p>
	 *<p> 时间: 2013-9-26 上午11:36:10 </p>
	 *<p> 版本: 1.0.1 </p>
	 *********************************************************
	 */
	public UserResult queryByMemberCode(Long memberCode);
	
	/**
	 * *******************************************************
	 *<p> 描述: *-- <b>用户登录</b> --* </p>
	 *<p> 作者: 赵肖瑶 </p>
	 *<p> 时间: 2013-9-26 下午04:58:50 </p>
	 *<p> 版本: 1.0.1 </p>
	 *********************************************************
	 */
	public UserResult login(String loginID,String loginPWD,String loginIP);
	
	/**
	 * *******************************************************
	 *<p> 描述: *-- <b>找回密码功能</b> --* </p>
	 *<p> 作者: 赵肖瑶 </p>
	 *<p> 时间: 2013-10-8 上午10:38:00 </p>
	 *<p> 版本: 1.0.1 </p>
	 *********************************************************
	 */
	public UserResult forgetPwd(Long memberCode);
	
	
	public UserResult forgetPwdWithChannel(Long memberCode);
	
	/**
	 * *******************************************************
	 *<p> 描述: *-- <b>绑定邮箱</b> --* </p>
	 *<p> 作者: 赵肖瑶 </p>
	 *<p> 时间: 2013-10-8 下午02:18:30 </p>
	 *<p> 版本: 1.0.1 </p>
	 *********************************************************
	 */
	public UserResult bindMail(Long memberCode,String email);
	
	/**
	 * *******************************************************
	 *<p> 描述: *-- <b>更改密码</b> --* </p>
	 *<p> 作者: 赵肖瑶 </p>
	 *<p> 时间: 2013-10-8 下午03:03:40 </p>
	 *<p> 版本: 1.0.1 </p>
	 *********************************************************
	 */
	public UserResult updatePwd(Long memberCode,String oldPwd,String newPwd);
	
	
	/**
	 * *******************************************************
	 *<p> 描述: *-- <b>绑定手机号码</b> --* </p>
	 *<p> 作者: 赵肖瑶 </p>
	 *<p> 时间: 2013-10-8 下午03:50:27 </p>
	 *<p> 版本: 1.0.1 </p>
	 *********************************************************
	 */
	public UserResult bindMobile(Long memberCode,String mobile);
	
}